lelebrr/Willy_ESP32_S3/src/modules/others/audio.cpp
#include "audio.h"
#include "core/mykeyboard.h"

#if defined(HAS_NS4168_SPKR)
#ifndef DISABLE_AUDIO
#include "AudioFileSourceFunction.h"
#include "AudioFileSourceHTTP.h"
#include "AudioGeneratorAAC.h"
#include "AudioGeneratorFLAC.h"
#include "AudioGeneratorMIDI.h"
#include "AudioGeneratorMP3.h"
#include "AudioGeneratorWAV.h"
#include "AudioOutputI2SNoDAC.h"
#include <ESP8266Audio.h>
#include <ESP8266SAM.h>
#endif

/**
 * @brief Initialize the speaker/amplifier codec.
 *
 * This function is weak, meaning it can be overridden by specific board
 * implementations in main.cpp if they require custom I2C or GPIO setup for
 * their audio hardware. If no custom setup is needed, it checks for generic
 * AMP_EN pins or IO expanders.
 *
 * @param enable True to enable the speaker, false to disable.
 */
__attribute__((weak)) void _setup_codec_speaker(bool enable) {
#ifdef IO_EXP_SPKR
  if (enable)
    ioExpander.turnPinOnOff(IO_EXP_SPKR, HIGH);
  else
    ioExpander.turnPinOnOff(IO_EXP_SPKR, LOW);
#endif
#ifdef AMP_EN_PIN
  if (AMP_EN_PIN >= 0) {
    pinMode(AMP_EN_PIN, OUTPUT);
    digitalWrite(AMP_EN_PIN, enable ? HIGH : LOW);
  }
#endif
}

// Volume control constants
static const float AUDIO_VOLUME_SCALE = 0.1f;
static const float AUDIO_VOLUME_MAX = 100.0f;

// Task configuration
static const uint32_t AUDIO_TASK_STACK_SIZE =
    16384; // 16KB - increased for complex MP3 files
static const UBaseType_t AUDIO_TASK_PRIORITY = 1;
static const BaseType_t AUDIO_TASK_CORE = 1; // Core 1

// ===== ASYNC PLAYBACK STATE =====
struct AudioPlayerState {
  // Playback objects
  AudioGenerator *generator;
  AudioFileSource *source;
  AudioOutputI2S *output;

  // State management
  PlaybackState state;
  PlaybackMode mode;
  String currentFile;

  // Control flags (volatile for thread safety)
  volatile bool stopRequested;
  volatile bool pauseRequested;
  volatile bool volumeChanged;
  volatile uint8_t newVolume;
  float currentGain; // Store current gain for pause fade

  // Timing info
  unsigned long startTime;
  unsigned long pausedTime;
  unsigned long totalPausedDuration;

  // Task handle
  TaskHandle_t taskHandle;

  // Mutex for thread safety
  SemaphoreHandle_t mutex;

  AudioPlayerState()
      : generator(nullptr), source(nullptr), output(nullptr),
        state(PLAYBACK_IDLE), mode(PLAYBACK_BLOCKING), currentFile(""),
        stopRequested(false), pauseRequested(false), volumeChanged(false),
        newVolume(0), currentGain(1.0f), startTime(0), pausedTime(0),
        totalPausedDuration(0), taskHandle(nullptr), mutex(nullptr) {
    mutex = xSemaphoreCreateMutex();
  }

  ~AudioPlayerState() {
    // Ensure task is stopped before destruction
    if (taskHandle != nullptr) {
      stopRequested = true;
      // Wait with timeout
      for (int i = 0; i < 200; i++) { // 2 seconds max
        if (taskHandle == nullptr)
          break;
        vTaskDelay(pdMS_TO_TICKS(10));
      }
    }

    cleanup();

    if (mutex) {
      vSemaphoreDelete(mutex);
      mutex = nullptr;
    }
  }

  void cleanup() {
    if (generator) {
      if (generator->isRunning()) {
        generator->stop();
      }
      delete generator;
      generator = nullptr;
    }
    if (source) {
      source->close();
      delete source;
      source = nullptr;
    }
    if (output) {
      output->stop();
      delete output;
      output = nullptr;
    }
  }

  bool lock(TickType_t timeout = portMAX_DELAY) {
    if (mutex) {
      return xSemaphoreTake(mutex, timeout) == pdTRUE;
    }
    return false;
  }

  void unlock() {
    if (mutex) {
      xSemaphoreGive(mutex);
    }
  }
};

// Global player state
static AudioPlayerState *g_audioPlayer = nullptr;

// Initialize player state
static void initAudioPlayer() {
  if (!g_audioPlayer) {
    g_audioPlayer = new AudioPlayerState();
  }
}

// Internal helper - unified audio output creation
static AudioOutputI2S *createConfiguredAudioOutput() {
#ifndef DISABLE_AUDIO
  AudioOutputI2S *audioout = new AudioOutputI2S();

  if (!audioout) {
    Serial.println("ERROR: AudioOutputI2S allocation failed");
    return nullptr;
  }

  audioout->SetPinout(BCLK, WCLK, DOUT, MCLK);
  audioout->SetGain(willyConfig.soundVolume / AUDIO_VOLUME_MAX);

  return audioout;
#else
  return nullptr;
#endif
}

// Helper to validate file existence
static bool validateAudioFile(FS *fs, const String &filepath) {
  if (!fs) {
    Serial.println("ERROR: Invalid filesystem pointer");
    return false;
  }

  if (!fs->exists(filepath.c_str())) {
    Serial.print("ERROR: Audio file not found: ");
    Serial.println(filepath);
    return false;
  }

  File file = fs->open(filepath.c_str(), "r");
  if (!file) {
    Serial.println("ERROR: Cannot open audio file");
    return false;
  }

  bool isFile = !file.isDirectory();
  size_t fileSize = file.size();
  file.close();

  if (!isFile) {
    Serial.println("ERROR: Path is a directory, not a file");
    return false;
  }

  if (fileSize == 0) {
    Serial.println("ERROR: Audio file is empty");
    return false;
  }

  return true;
}

// ===== ASYNC PLAYBACK TASK =====
static void audioPlaybackTask(void *parameter) {
  if (!g_audioPlayer) {
    vTaskDelete(NULL);
    return;
  }

  AudioPlayerState *player = g_audioPlayer;

  Serial.println("Audio playback task started");

  // Main playback loop
  while (player->generator && player->generator->isRunning()) {
    // Check for stop request (prioritized check)
    if (player->stopRequested) {
      Serial.println("Stop requested");
      break;
    }

    // Check for pause request
    if (player->pauseRequested) {
      if (player->lock(pdMS_TO_TICKS(100))) {
        if (player->state == PLAYBACK_PLAYING) {
          // Fade out volume to prevent pop/crackling
          for (int i = 10; i >= 0; i--) {
            player->output->SetGain(player->currentGain * i / 10.0f);
            vTaskDelay(pdMS_TO_TICKS(8));
          }

          // Stop I2S output to prevent buffer loop
          player->output->stop();

          player->state = PLAYBACK_PAUSED;
          player->pausedTime = millis();
          Serial.println("Playback paused - I2S stopped");
        } else if (player->state == PLAYBACK_PAUSED) {
          // Restart I2S output
          if (!player->output->begin()) {
            Serial.println("ERROR: Failed to restart I2S output");
            player->pauseRequested = false;
            player->unlock();
            break; // Exit task if can't restart
          }

          // Restore volume with fade in
          for (int i = 0; i <= 10; i++) {
            player->output->SetGain(player->currentGain * i / 10.0f);
            vTaskDelay(pdMS_TO_TICKS(8));
          }

