lelebrr/Willy_ESP32_S3/src/modules/others/audio.cpp
          player->state = PLAYBACK_PLAYING;
          player->totalPausedDuration += millis() - player->pausedTime;
          Serial.println("Playback resumed - I2S restarted");
        }
        player->pauseRequested = false;
        player->unlock();
      }
    }

    // Check for volume change request
    if (player->volumeChanged && player->output) {
      if (player->lock(pdMS_TO_TICKS(50))) {
        player->currentGain = player->newVolume / AUDIO_VOLUME_MAX;
        player->output->SetGain(player->currentGain);
        player->volumeChanged = false;
        player->unlock();
        Serial.print("Volume changed to: ");
        Serial.println(player->newVolume);
      }
    }

    // Only loop generator when not paused
    if (player->state == PLAYBACK_PLAYING) {
      if (!player->generator->loop()) {
        Serial.println("Generator loop ended");
        break;
      }
    } else {
      // Paused - yield to prevent busy waiting
      vTaskDelay(pdMS_TO_TICKS(50));
    }

    // Yield to prevent watchdog timeout
    taskYIELD();
  }

  // Cleanup after playback
  Serial.println("Audio playback task ending");

  // Use timeout on lock to prevent deadlock
  if (player->lock(pdMS_TO_TICKS(1000))) {
    player->state = PLAYBACK_STOPPING;

    if (player->output)
      player->output->stop();
    if (player->source)
      player->source->close();

    player->cleanup();
    player->state = PLAYBACK_IDLE;
    player->currentFile = "";

    // Clear task handle BEFORE unlocking
    player->taskHandle = nullptr;

    player->unlock();
  } else {
    // Couldn't acquire lock - force cleanup anyway
    Serial.println("WARNING: Force cleanup without lock");
    player->taskHandle = nullptr;
  }

  _setup_codec_speaker(false);

  // Delete task (must be last operation)
  vTaskDelete(NULL);
}
// ===== PUBLIC API IMPLEMENTATION =====

bool stopAudioPlayback() {
  initAudioPlayer();

  if (!g_audioPlayer)
    return false;

  // Quick check without lock
  if (g_audioPlayer->state == PLAYBACK_IDLE) {
    return false;
  }

  // Signal stop
  g_audioPlayer->stopRequested = true;

  // Wait for task to finish with timeout (2 seconds)
  unsigned long startWait = millis();
  while (g_audioPlayer->taskHandle != nullptr &&
         (millis() - startWait) < 2000) {
    vTaskDelay(pdMS_TO_TICKS(10));
  }

  // Force cleanup if timeout
  if (g_audioPlayer->taskHandle != nullptr) {
    Serial.println("WARNING: Stop timeout - forcing cleanup");
    if (g_audioPlayer->lock(pdMS_TO_TICKS(500))) {
      g_audioPlayer->cleanup();
      g_audioPlayer->state = PLAYBACK_IDLE;
      g_audioPlayer->taskHandle = nullptr;
      g_audioPlayer->unlock();
    }
  }

  return true;
}

bool pauseAudioPlayback() {
  initAudioPlayer();

  if (!g_audioPlayer)
    return false;

  PlaybackState currentState = g_audioPlayer->state;
  if (currentState != PLAYBACK_PLAYING && currentState != PLAYBACK_PAUSED) {
    return false;
  }

  g_audioPlayer->pauseRequested = true;

  return true;
}

bool isAudioPlaying() {
  initAudioPlayer();

  if (!g_audioPlayer)
    return false;

  PlaybackState state = g_audioPlayer->state;
  return (state == PLAYBACK_PLAYING || state == PLAYBACK_PAUSED);
}

AudioPlaybackInfo getAudioPlaybackInfo() {
  initAudioPlayer();

  AudioPlaybackInfo info;
  info.state = PLAYBACK_IDLE;
  info.currentFile = "";
  info.duration = 0;
  info.position = 0;
  info.volume = willyConfig.soundVolume;
  info.isAsyncMode = false;

  if (!g_audioPlayer)
    return info;

  if (g_audioPlayer->lock(pdMS_TO_TICKS(100))) {
    info.state = g_audioPlayer->state;
    info.currentFile = g_audioPlayer->currentFile;
    info.duration = getAudioDuration(g_audioPlayer->currentFile);
    info.volume = willyConfig.soundVolume;
    info.isAsyncMode = (g_audioPlayer->mode == PLAYBACK_ASYNC);

    // Calculate position
    if (g_audioPlayer->state == PLAYBACK_PLAYING) {
      info.position = millis() - g_audioPlayer->startTime -
                      g_audioPlayer->totalPausedDuration;
    } else if (g_audioPlayer->state == PLAYBACK_PAUSED) {
      info.position = g_audioPlayer->pausedTime - g_audioPlayer->startTime -
                      g_audioPlayer->totalPausedDuration;
    }

    g_audioPlayer->unlock();
  }

  return info;
}

void setAudioPlaybackVolume(uint8_t volume) {
  if (volume > 100)
    volume = 100;

  // Update config
  willyConfig.setSoundVolume(volume);

  initAudioPlayer();

  // If playing, signal volume change to task
  if (g_audioPlayer && g_audioPlayer->state != PLAYBACK_IDLE) {
    g_audioPlayer->newVolume = volume;
    g_audioPlayer->volumeChanged = true;
  }
}

// ===== HELPER: Start async playback task =====
static bool startAsyncPlayback(AudioGenerator *generator,
                               AudioFileSource *source, AudioOutputI2S *output,
                               const String &filename) {
  initAudioPlayer();

  if (!g_audioPlayer->lock(pdMS_TO_TICKS(1000))) {
    Serial.println("ERROR: Could not acquire lock for async playback");
    delete generator;
    delete source;
    delete output;
    _setup_codec_speaker(false);
    return false;
  }

  // Set up state
  g_audioPlayer->generator = generator;
  g_audioPlayer->source = source;
  g_audioPlayer->output = output;
  g_audioPlayer->state = PLAYBACK_PLAYING;
  g_audioPlayer->mode = PLAYBACK_ASYNC;
  g_audioPlayer->currentFile = filename;
  g_audioPlayer->stopRequested = false;
  g_audioPlayer->pauseRequested = false;
  g_audioPlayer->volumeChanged = false;
  g_audioPlayer->currentGain =
      willyConfig.soundVolume / AUDIO_VOLUME_MAX; // Store initial gain
  g_audioPlayer->startTime = millis();
  g_audioPlayer->pausedTime = 0;
  g_audioPlayer->totalPausedDuration = 0;

  g_audioPlayer->unlock();

  // Create task
  BaseType_t result = xTaskCreatePinnedToCore(
      audioPlaybackTask, "AudioPlayback", AUDIO_TASK_STACK_SIZE, NULL,
      AUDIO_TASK_PRIORITY, &g_audioPlayer->taskHandle, AUDIO_TASK_CORE);

  if (result != pdPASS || !g_audioPlayer->taskHandle) {
    Serial.println("ERROR: Failed to create playback task");

    // Cleanup on failure
    if (g_audioPlayer->lock(pdMS_TO_TICKS(500))) {
      g_audioPlayer->cleanup();
      g_audioPlayer->state = PLAYBACK_IDLE;
      g_audioPlayer->taskHandle = nullptr;
      g_audioPlayer->unlock();
    }

    _setup_codec_speaker(false);
    return false;
  }

