lelebrr/Willy_ESP32_S3/src/modules/others/audio.cpp
  return true;
}

// ===== CORE PLAYBACK FUNCTIONS =====

bool playAudioFile(FS *fs, String filepath, PlaybackMode mode) {
  if (!willyConfig.soundEnabled)
    return false;

  if (!validateAudioFile(fs, filepath)) {
    return false;
  }

  // Stop any current playback
  if (isAudioPlaying()) {
    stopAudioPlayback();
  }

  _setup_codec_speaker(true);

  AudioFileSource *source = new AudioFileSourceFS(*fs, filepath.c_str());
  if (!source) {
    Serial.println("ERROR: Failed to create audio source");
    _setup_codec_speaker(false);
    return false;
  }

  AudioOutputI2S *audioout = createConfiguredAudioOutput();
  if (!audioout) {
    delete source;
    _setup_codec_speaker(false);
    return false;
  }

  AudioGenerator *generator = NULL;

  filepath.toLowerCase();
  if (filepath.endsWith(".txt") || filepath.endsWith(".rtttl"))
    generator = new AudioGeneratorRTTTL();
  else if (filepath.endsWith(".wav"))
    generator = new AudioGeneratorWAV();
  else if (filepath.endsWith(".mod"))
    generator = new AudioGeneratorMOD();
  else if (filepath.endsWith(".opus"))
    generator = new AudioGeneratorOpus();
  else if (filepath.endsWith(".aac"))
    generator = new AudioGeneratorAAC();
  else if (filepath.endsWith(".flac"))
    generator = new AudioGeneratorFLAC();
  else if (filepath.endsWith(".mp3")) {
    generator = new AudioGeneratorMP3();
    source = new AudioFileSourceID3(source);
  }

  if (!generator) {
    Serial.println("ERROR: Unsupported audio format");
    delete source;
    delete audioout;
    _setup_codec_speaker(false);
    return false;
  }

  if (!generator->begin(source, audioout)) {
    Serial.println("ERROR: Failed to begin audio playback");
    delete generator;
    delete source;
    delete audioout;
    _setup_codec_speaker(false);
    return false;
  }

  // === BLOCKING MODE ===
  if (mode == PLAYBACK_BLOCKING) {
    Serial.println("Start audio (blocking)");

    while (generator->isRunning()) {
      if (!generator->loop() || check(AnyKeyPress)) {
        generator->stop();
      }
    }

    audioout->stop();
    source->close();
    Serial.println("Stop audio");

    delete generator;
    delete source;
    delete audioout;

    _setup_codec_speaker(false);
    return true;
  }

  // === ASYNC MODE ===
  Serial.println("Start audio (async)");
  return startAsyncPlayback(generator, source, audioout, filepath);
}

bool playAudioUrl(String url, PlaybackMode mode) {
  if (!willyConfig.soundEnabled)
    return false;

  url.trim();
  if (url == "" || !url.startsWith("http")) {
    Serial.println("ERROR: Invalid URL for audio streaming");
    return false;
  }

  // Stop any current playback
  if (isAudioPlaying()) {
    stopAudioPlayback();
  }

  _setup_codec_speaker(true);

  AudioFileSource *source = new AudioFileSourceHTTP(url.c_str());
  if (!source) {
    Serial.println("ERROR: Failed to create HTTP audio source");
    _setup_codec_speaker(false);
    return false;
  }

  AudioOutputI2S *audioout = createConfiguredAudioOutput();
  if (!audioout) {
    delete source;
    _setup_codec_speaker(false);
    return false;
  }

  // For web radio, assume MP3 format (most common)
  AudioGenerator *generator = new AudioGeneratorMP3();
  if (!generator) {
    Serial.println("ERROR: Failed to create MP3 generator");
    delete source;
    delete audioout;
    _setup_codec_speaker(false);
    return false;
  }

  // Wrap source with ID3 tag handler for MP3
  AudioFileSource *id3source = new AudioFileSourceID3(source);
  if (!id3source) {
    Serial.println("ERROR: Failed to create ID3 source");
    delete generator;
    delete source;
    delete audioout;
    _setup_codec_speaker(false);
    return false;
  }

  if (!generator->begin(id3source, audioout)) {
    Serial.println("ERROR: Failed to begin audio streaming");
    delete generator;
    delete id3source;
    delete source;
    delete audioout;
    _setup_codec_speaker(false);
    return false;
  }

  // === BLOCKING MODE ===
  if (mode == PLAYBACK_BLOCKING) {
    Serial.println("Start web radio (blocking)");

    while (generator->isRunning()) {
      if (!generator->loop() || check(AnyKeyPress)) {
        generator->stop();
      }
    }

    audioout->stop();
    id3source->close();
    Serial.println("Stop web radio");

    delete generator;
    delete id3source;
    delete source;
    delete audioout;

    _setup_codec_speaker(false);
    return true;
  }

  // === ASYNC MODE ===
  Serial.println("Start web radio (async)");
  return startAsyncPlayback(generator, id3source, audioout, url);
}

bool playAudioRTTTLString(String song, PlaybackMode mode) {
  if (!willyConfig.soundEnabled)
    return false;

  song.trim();
  if (song == "") {
    Serial.println("ERROR: Empty RTTTL string");
    return false;
  }

  if (isAudioPlaying()) {
    stopAudioPlayback();
  }

  _setup_codec_speaker(true);

  AudioOutputI2S *audioout = createConfiguredAudioOutput();
  if (!audioout) {
    _setup_codec_speaker(false);
    return false;
  }

  AudioGenerator *generator = new AudioGeneratorRTTTL();
  if (!generator) {
    delete audioout;
    _setup_codec_speaker(false);
    return false;
  }

  AudioFileSource *source =
      new AudioFileSourcePROGMEM(song.c_str(), song.length());
  if (!source) {
    delete generator;
    delete audioout;
    _setup_codec_speaker(false);
    return false;
  }

  if (!generator->begin(source, audioout)) {
    Serial.println("ERROR: Failed to begin RTTTL playback");
    delete generator;
    delete source;
    delete audioout;
    _setup_codec_speaker(false);
    return false;
  }

  // === BLOCKING MODE ===
  if (mode == PLAYBACK_BLOCKING) {
    Serial.println("Start RTTTL (blocking)");

    while (generator->isRunning()) {
      if (!generator->loop() || check(AnyKeyPress)) {
        generator->stop();
      }
    }

    audioout->stop();
    source->close();
    Serial.println("Stop audio");

    delete generator;
    delete source;
    delete audioout;

    _setup_codec_speaker(false);
    return true;
  }

