lelebrr/Willy_ESP32_S3/src/modules/others/audio.cpp
  // === ASYNC MODE ===
  Serial.println("Start RTTTL (async)");
  return startAsyncPlayback(generator, source, audioout, "RTTTL");
}
bool tts(String text, PlaybackMode mode) {
  if (!willyConfig.soundEnabled)
    return false;

  text.trim();
  if (text == "") {
    Serial.println("ERROR: Empty TTS text");
    return false;
  }

  // TTS is always blocking - ESP8266SAM doesn't support async playback
  if (mode == PLAYBACK_ASYNC) {
    Serial.println("WARNING: TTS doesn't support async mode, using blocking");
  }

  // Stop any current playback
  if (isAudioPlaying()) {
    stopAudioPlayback();
  }

  _setup_codec_speaker(true);

  AudioOutputI2S *audioout = createConfiguredAudioOutput();
  if (!audioout) {
    _setup_codec_speaker(false);
    return false;
  }

  if (!audioout->begin()) {
    Serial.println("ERROR: Failed to initialize audio output for TTS");
    delete audioout;
    _setup_codec_speaker(false);
    return false;
  }

  ESP8266SAM *sam = new ESP8266SAM;
  if (!sam) {
    delete audioout;
    _setup_codec_speaker(false);
    return false;
  }

  // TTS synthesis (always blocking)
  sam->Say(audioout, text.c_str());

  delete sam;
  delete audioout;

  _setup_codec_speaker(false);
  return true;
}

/**
 * @brief Calculate the total duration of an audio file in milliseconds
 * @param filepath Path to the audio file
 * @return Duration in ms, or 0 if unknown or error
 */
unsigned long getAudioDuration(String filepath) {
  if (!isAudioFile(filepath))
    return 0;

  File file = SPIFFS.open(filepath, "r");
  if (!file)
    return 0;

  if (filepath.endsWith(".wav")) {
    // WAV header parsing
    // Skip RIFF header (4 bytes "RIFF", 4 bytes size)
    file.seek(8);
    // Skip "WAVE" and "fmt " (8 bytes)
    file.seek(16);
    // Sample rate at offset 24 (4 bytes, little endian)
    uint32_t sampleRate = 0;
    file.read((uint8_t *)&sampleRate, 4);
    // Channels at offset 22 (2 bytes)
    uint16_t channels = 0;
    file.seek(22);
    file.read((uint8_t *)&channels, 2);
    // Bits per sample at offset 34 (2 bytes)
    uint16_t bitsPerSample = 0;
    file.seek(34);
    file.read((uint8_t *)&bitsPerSample, 2);
    // Data size at offset 40 (4 bytes)
    uint32_t dataSize = 0;
    file.seek(40);
    file.read((uint8_t *)&dataSize, 4);

    file.close();

    if (sampleRate == 0 || channels == 0 || bitsPerSample == 0)
      return 0;

    // Duration = dataSize / (sampleRate * channels * bitsPerSample / 8) * 1000
    float bytesPerSecond = sampleRate * channels * (bitsPerSample / 8.0f);
    if (bytesPerSecond == 0)
      return 0;
    return (unsigned long)((dataSize / bytesPerSecond) * 1000);
  }

  // For other formats, return 0 for now (could implement MP3 ID3 tags, etc.)
  file.close();
  return 0;
}

bool isAudioFile(String filepath) {
  return filepath.endsWith(".opus") || filepath.endsWith(".rtttl") ||
         filepath.endsWith(".txt") || filepath.endsWith(".wav") ||
         filepath.endsWith(".mod") || filepath.endsWith(".mp3") ||
         filepath.endsWith(".aac") || filepath.endsWith(".flac");
}

void playTone(unsigned int frequency, unsigned long duration, short waveType) {
  if (!willyConfig.soundEnabled)
    return;

  _setup_codec_speaker(true);

  if (frequency == 0 || duration == 0) {
    _setup_codec_speaker(false);
    return;
  }

  float hz = frequency;

  AudioOutputI2S *out = createConfiguredAudioOutput();
  if (!out) {
    _setup_codec_speaker(false);
    return;
  }

  AudioFileSourceFunction *file =
      new AudioFileSourceFunction(duration / 1000.0);
  if (!file) {
    delete out;
    _setup_codec_speaker(false);
    return;
  }

  float volumeScale =
      (willyConfig.soundVolume / AUDIO_VOLUME_MAX) * AUDIO_VOLUME_SCALE;

  if (waveType == 0) {
    file->addAudioGenerators([volumeScale, hz](const float time) {
      float v = (sin(hz * time) >= 0) ? 1.0f : -1.0f;
      v *= volumeScale;
      return v;
    });
  } else if (waveType == 1) {
    file->addAudioGenerators([volumeScale, hz](const float time) {
      float v = sin(TWO_PI * hz * time);
      v *= fmod(time, 1.f);
      v *= volumeScale;
      return v;
    });
  }

  AudioGeneratorWAV *wav = new AudioGeneratorWAV();
  if (!wav) {
    delete file;
    delete out;
    _setup_codec_speaker(false);
    return;
  }

  if (!wav->begin(file, out)) {
    Serial.println("ERROR: Failed to begin tone playback");
    delete wav;
    delete file;
    delete out;
    _setup_codec_speaker(false);
    return;
  }

  while (wav->isRunning()) {
    if (!wav->loop() || check(AnyKeyPress)) {
      wav->stop();
    }
  }

  delete file;
  delete wav;
  delete out;

  _setup_codec_speaker(false);
}

#endif

void _tone(unsigned int frequency, unsigned long duration) {
  if (!willyConfig.soundEnabled)
    return;

#if defined(BUZZ_PIN)
  tone(BUZZ_PIN, frequency, duration);
#elif defined(HAS_NS4168_SPKR)
#ifndef DISABLE_AUDIO
  playTone(frequency, duration, 0);
#endif
#endif
}
